National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>KAr7lHx4hoO20hHgu90K7sp4F3jNoFXWAC4f3H6p8p4B+/SOFtAFpmQV8D+U8EAMGABfMgg0TwT8&#13;
pglRAkq3r7tj6nhPQa3ZPksiKr9l0mgtcZLE73RKyp07BpVsfPi+Y9kQbsBK4o6uc/5gnKIQqFiy&#13;
VRW0u6Lz6+IuA+1VUmUyQ5/VH4DY0Y85cEPjHkI3D2ZPad07tob3p0S1rukvT7/FHCWJFP3TfbVW&#13;
KyVqoyF3rP597Ry4CMnuhKVQaep7kdx/RSAap2n5fZ1zmJaPX7KX+8fMEcOhLdIRmD6Mw+5bG1th&#13;
cx2assYpKJ76mSTygUlUt5X660qKWFgUJy1hVA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>yPCR0N+ozGoz1lld7sX9hMDKCfom5q5Cjg9pn8ifLX6NyWTLcndDnRwsh7frpJHmRMitRktQURBN&#13;
lYrLHKtKl3ywapQy5frG1u+988L09fOFHB+HZ9WUXS0klUe7YDVQ9P2fNbg2aWnGLP6UQMJIx84q&#13;
qlQPcnJc9gsfdfUUXBdjuWtgWqt1J+CAbdWXqHBpiWbfy1z+BMTL0StMFcrYfqaeEEDgTOiDFqpC&#13;
3+IpWEGEHzl/LUHtiPFWrrEILJvxnZeynh598E1ANwd9xGbgidBHag3e/K91jtHIje7Z0Jvwpk/t&#13;
nE/nX5Hb57nS8eigQ8A6FJxC8AwAZ7GJYr7u6xdaix8dprzw2zpmzUi8xpongexlyDNW/+3ptxbj&#13;
XQ8bQBbl1/2bgQlhlrf7qvhumMzp+8InHUVI0f6jAB9utaJXf4zNNZCuD5v8WOzMXdGFqYUF4ZPl&#13;
mgzSrHO/T9oC3TfSxP8uBL5gqxsYwPx8lm5Q+vZ05TtnXz5U+BmQwTt1sIXkytNtAZexiC2rhJ5T&#13;
MnlWtvw2cd5yIgTqOM/XPF0uYL9OC7CzqUwMQgKsnQKwzbw2rnbTq+dk8bNUPmFjRfzGdcp++6F1&#13;
D2a/3L8CbMSIUNV4y89UMGZcwPDxn/I2O66KYqtxxd1nPrsjTNITv/W4RjlzRGKQKYs+yurCQUuC&#13;
BIHJHeCdAWxH2ywBesshCMT6ZwTEsFfgOI17phoqSofm6FwPsTa28xDiLgyFkr4qC06VPs5N+6TN&#13;
YsJClNUt1H4lX7r+hqrb/mHwX7vWLVbWV7uixS7u20j1E6i3OE5s72CComEvYmQ8f1h3RI/sSqn4&#13;
qs+skO+Nf/59BJF1z4yQavlzKIyEDEI+PhArLTTRy+IohegRwb8usUpE/NemOSP6Q21YNDTRU4Ih&#13;
tH+1KrbaXuLt9FdrKu7pUMD1S40MyO6aFfglwYlibVJr6vHtz8dMcyeV1bsT+cS67Vs6Jhe+KtS+&#13;
mY0uDGSPtwGIhc6IlCSfmocycvW9EW9MXSQtx+KUBal6vC7Dd8d/2h1ZzIGk1ov0TSMDFzk2e8Vi&#13;
k77gwZE/zq0+XOpgY1AMer7kcGz0VAZSfq0GXFuXN0MoQNlfcDs0+uVNfcl1Yxt/I5bpb8K1tZGE&#13;
TbKth+gcZj79LAeGaVkQmZqmdh820z/t3D4OBA8w7XYCIyrHLNgwlbN//v1NtBgkjTTEsy6dU97S&#13;
ubgPNRJqg00gRl3CdbSCGCfzZIzLsvncqaPT9Q/PVfXJhhwY6u6F7E1LRCITH0/YzuN/C2uIjdpW&#13;
Xl/0MP5B+reA2w5VzLRpfPj3hy/OtK1Sg5M+SBmLYrbs8s31kN8KAtuvoDidflLtpZLYsUrnhTem&#13;
U+4e+T/LerqyD53P/DhEHoT3UL80wCNL6SWbsi2nR3SAeNr+MMi7xUeMGrn4WvEik64qtattwLeq&#13;
pe9Uv5Y+DSejzda6InprLluXw+M4j1PcBYjcSj3mUNPPyNpmlhmJ5RI8m8gKFHDabl0LFO34NuC3&#13;
I13JIS4jHkWNmFy6Pm2QfOG3KTqcwHksALJUYqELI/DirdGQ7NWnGwoN3h2iQRH+Oe6OlAQvvauw&#13;
T541iExff9NeyeQeGcuaMbMq7cPhItxDm61bB0e2+KuL03kJWRi8BOLYz8FZFJ1ead4laf8h3xYE&#13;
udefjA4XjaBNYz4ugdT+IEtl57gwDTBGlCH1Z31gW0JSjXWvxvGofUKfsTULuffpzrAfIUyQX4KJ&#13;
tcRbSiqOXiDIeXKMIEOUArZcB6+INbjAMVdXte3gy5CJH9dD3cUu+t/Uv0A6+OxaInJPNBPyljoV&#13;
42KoXSxaAkV7cMtHEotjUDjBu+dqLdnTHYS0/ip9twqCXlNU6lB1XWxMEtPKPWsB61pwcnZSAPUq&#13;
0tFEBfYULhph0IZeom3E9ivnrJgwV4hxr7TmAqBmihfMLQcECmWaVfUOyruk9r/PrRongfFtL1bK&#13;
O57uqrFQ1WWRN4RdnokYQRJRW3KUAZ/Yfk27q4JR0OwCh4vKyrV9ckVE9fVJf/XMsl3p11iOS7TJ&#13;
jrb7pFTINlAoDDsfKBPumDNpShoMbQKTTVVQFyP9CAeZCogFQAquntnqoWN4fbXiBROZCLzqDW1G&#13;
lC+ZSg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>waFRnzXw8ksB/4W3SavNEFkm31Y=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
GZ0PiLkQQDlJohX95g/b6dVALg0bjLJcS+IigHD3QquwIlL0wB1TvCxYr5T4Z/n5EJmzf06O4ZXm&#13;
MmEgPzrLMAESbLnPhVc0zJ/t0Uda8B5cMFEHGH9ljhljNmr8Ry5a7HVPbOFjKvr2wo+1MYCO8+6N&#13;
y1R4FvYmI3PfCbHM4qnBNzJS8NIreTTP2U1EIc8qp7phROulaS96rkMifAi+DK7pNjAfo51HLsEE&#13;
UD5t/uUBZySWt8+5wNwsvNJSI5zUyd2BA1DdeG25+Gd03o7FtKHMM0JcG0780M+6ZVH9Hsq4xL02&#13;
ahADB2YpEPpXWDuyx/+LchD8kk94xjzZJFWezg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>